[
    "Семеен скандал:\n- Стига си врещяла, комшиите ни чуха! Влез в чата да се разберем като хората...",
    "- Госпожо, възможно ли е да имате някакъв вирус в компютъра?\n- Невъзможно е аз навън не съм го изкарвала...",
    "Има хора, които са като ъпдейт на софтуер!!! Когато ги видиш, си казваш: - Не сега...",
    "Да се знае и да не се бърка: хардуерът е това, което ритате. Софтуерът е това, което псувате.",
    "- Ало! Имам проблем с компютъра...На монитора ми пише, че не разпознава принтера.\n- И Вие какво направихте?\n- Обърнах монитора към принтера, за да го види и разпознае. И пак не го разпознава. Какво да правя?\n- Посочете му го с пръст!",
    "Съпрузи програмисти се карат:\n- Гадняр!\n- А ти си глупачка!\n- Да си забравиш всичките пароли дано!\n- Тук вече прекали!",
    "Програмист гледа кода и си мрънка:\n- Баси, защо стана така?!\nНегов колега се обажда:\n- Така е било писано..",
    "Семеен скандал:\n- Стига си врещяла, комшиите ни чуха! Влез в чата да се разберем като хората...",
    "- Госпожо, възможно ли е да имате някакъв вирус в компютъра?\n- Невъзможно е аз навън не съм го изкарвала...",
    "Има хора, които са като ъпдейт на софтуер!!! Когато ги видиш, си казваш: - Не сега...",
    "Да се знае и да не се бърка: хардуерът е това, което ритате. Софтуерът е това, което псувате.",
    "- Ало! Имам проблем с компютъра...На монитора ми пише, че не разпознава принтера.\n- И Вие какво направихте?\n- Обърнах монитора към принтера, за да го види и разпознае. И пак не го разпознава. Какво да правя?\n- Посочете му го с пръст!",
    "Съпрузи програмисти се карат:\n- Гадняр!\n- А ти си глупачка!\n- Да си забравиш всичките пароли дано!\n- Тук вече прекали!",
    "Програмист гледа кода и си мрънка:\n- Баси, защо стана така?!\nНегов колега се обажда:\n- Така е било писано..",
    "- Ало! Имам проблем с компютъра. На монитора ми пише, че не разпознава принтера.\n- И Вие какво направихте?\n- Обърнах монитора към принтера, за да го види и разпознае. И пак не го разпознава. Какво да правя?\n- Посочете му го с пръст!",
    "Програмистът има две чаши на нощното си шкафче - празна и пълна. Пълната - ако му се допие вода през нощта, празната - ако не му се допие. Системният администратор има още 2 такива чаши - в случай, че първата система откаже.",
    "Да чакаш да се приготви жена ти е като да сваляш нещо от интернет:\n- Остават 2 минути.\n- Остава 1 минута.\n- Остават 25 минути..",
    "След като видяха доходите на 5 млн. българи, хакерите се извиниха и започнаха благотворителна кампания за набиране на средства.",
    "- На колко години сте?\n- На 30!\n- Ама преди 10 години, като си направихте фейсбук профил, пак бяхте на 30...\n- Не съм от хората, които се отмятат от казаното!",
    "Един монитор - обикновен програмист. Два монитора - напреднал програмист. Три монитора - топ програмист. Четири и повече монитора - охранител.",
    "ОБЯВА: \"55-годишна майка на трима програмисти търси някой неувреден на тази тема да я научи как да ползва интернет.\"",
    "Заявявам еднократно на целия интернет, че не съм съгласен да използвам бисквитки! Аман, бе! Искам ракия и салата!",
    "Определение за програмист: Организъм, който превръща кофеин и пица в софтуер.",
    "1 монитор - обикновен програмист.\n2 монитора - напреднал програмист.\n3 монитора - топ програмист.\n4 и повече монитора - охранител.",
    "Заявявам веднъж завинаги на целия интернет, че не съм съгласен да използвам бисквитки, а бира и цаца. Престанете да ме питате!",
    "По телефона:\n- Г-жо, а възможно ли е да имате някакъв вирус в компютъра?\n- Невъзможно е, аз навън не съм го изкарвала.",
    "Форум за програмисти: - Как да сканирам документ, вкъщи съм, нямам скенер и не ми се излиза?\n- Сложи документа на прозореца, влез в Google Earth, приближи до прозореца и направи скрийншот...",
    "- Миличък, хайде остави компютъра и ела да вечеряме.\n- Идвам, мамо!\n- Аз не съм майка ти, аз съм жена ти!\n- Боже, как минава това време...",
    "Телефонно обаждане в сервиза за компютри:\n- Ало, сервизът ли е? Абе, компютърът ми не ще да се включи... Свалих кутията, там има някакви проводници, микросхеми и един умрял паяк. Аз не разбирам много от техника... сега какво – нов паяк ли трябва да купя?",
    "- Тате, ти бил ли програмист?\n- Бил съм, тате, програмист, и уебмастър съм бил, но най-много бих сисадмина, когато ми отряза достъпа до фейсбук в офиса.",
    "Програмистите чак сега разбраха, че начинът им на живот се казва “карантина”.",
    "Форум за програмисти:\n- Как да сканирам документ, в къщи съм, нямам скенер, и не ми се излиза?\n- Сложи документа на прозореца, влез в Google Earth, приближи до прозореца и направи скрийншот...",
    "Ако се притеснявате, че някой комшия ви краде от безжичния интернет, има много просто решение. Отворете прозорците, изключете рутера и се заслушайте! По псувните ще ги познаете!",
    "След като видяха доходите на 5 млн. българи, хакерите се извиниха и започнаха благотворителна кампания за набиране на средства..",
    "Още на времето прадядо ми беше хакер. Казваше:\n- Ако ти хакна един бастун!",
    "Надпис в отдел “Поддръжка на компютърната техника” на голяма фирма:\n- Теория - когато знаете всичко, но нищо не работи.\n- Практика - когато всичко работи, но не знаете защо.\n- При нас съчетаваме теорията с практиката - нищо не работи и нямаме понятие защо.",
    "4- годишният Митко хакна мрежата на общината и се класира директно в 5 детски градини.",
    "Съобщение: \"Вчера за пръв път хакер беше осъден за проникване в чужда компютърна мрежа и влезе в затвора да излежава 20-годишна присъда.\nПо данни от централния компютър на полицията, вдругиден хакерът излиза на свобода поради изтичане срока на наказанието\".",
    "Заявявам веднъж завинаги на целия интернет, че не съм съгласен да използвам бисквитки, а бира и цаца. Престанете да ме питате!",
    "Бъдете хладнокръвни пред компютъра – ако \"Уиндоус\" разбере, че имате спешна работа, ще почне да се ъпдейтва.",
    "- Ало, техниците? - Да, какъв е проблемът? - Не ми работи рутерът. - Кои лампи светят? - В хола и в банята. - Оставете, пращаме техник.",
    "- Защо вицовете за блондинки са повече от вицовете за програмисти?\n- Защото вицовете за блондинки ги разбират всички, освен блондинките, а вицовете за програмисти ги разбират само програмистите.",
    "По телефона : - Г- жо, а възможно ли е да имате някъкъв вирус в компютъра? - Невъзможно е, аз навън не съм го изкарвала....",
    "- Не разбирам как са ми разбили паролата?!\n- Каква беше?\n- Годината на коронацията на папа Григорий IX!\n- Коя е?\n- Хиляда двеста тридесет и четвърта...",
    "- Пешо, съседи сме с теб откакто се помним... мислиш ли, че ще ти крада wifi?!? - Не! - Ами... тогава защо непрекъснато сменяш паролата?!",
    "В Интернет се появи нов вид измама. Схемата е следната: ваш познат или приятел ви поздравява с Коледните празници и пита как сте. Вие подробно му разказвате, а него не го интересува!",
    "Въпрос в БГ мама:\n– Изтеглих файл от Интернет, но повече не ми трябва. Как да го върна обратно?\nОтговор:\n– Ето, заради такива нещастници като вас, скоро Интернет ще остане съвсем без файлове.",
    "Тя :\n- Ще дойдеш ли вкъщи довечера да ми преинсталираш windows-a ?\nТой:\n- Ама ти току що си купи лаптопа. Не ти трябва преинсталация.\nТя :\n- Ти тъп ли си или не разбираш от намеци?\nТой:\n- Ти не можеш да си преинсталираш уиндоуса, пък аз съм бил тъп...",
    "Возят се двама приятели в тролей и си говорят:\n- Ще трябва да си купя килимче на мишката, защото старото на нищо не прилича.\nСлучайно дочула ги пенсионерка възмутено се намесва в разговора:\n- Хората пари за хляб нямат, а те килимче за мишката ще си купуват!",
    "- Какво работиш?\n- Помагам на хора в неравностойно положение...\n- О! В някой дом или?\n- Системен администратор съм...",
    "Седи си един програмист в бара и идва една мацка при него:\n- Ако искаш да си прекараш хубаво, то аз се казвам Мими...\n- А ако не искам, то как се казваш?",
    "Детенце на програмист го пита, докато той е затънал дълбоко в дебъгването на сложна програма:\n- Тате, татееее... а слънцето утре ще изгрее ли?\nПрограмистът пита разсеяно:\n- Днес изгря ли?\n- Да.\n- А вчера?\n- Да.\n- Нищо не пипай!!!",
    "Съобщение: \"Вчера за пръв път хакер беше осъден за проникване в чужда компютърна мрежа и влезе в затвора да излежава 20-годишна присъда.\nПо данни от централния компютър на полицията, вдругиден хакерът излиза на свобода поради изтичане срока на наказанието\".",
    "Седи си един програмист в бараа, а към него приближава мацка:\n- Ако искаш да си прекараш хубаво, то аз се казвам Мими...\n- А ако не искам, то как се казваш?",
    "- Ало, техниците?\n- Да, какъв е проблемът?\n- Не ми работи рутерът.\n- Кои лампи светят?\n- В хола и в банята.\n- Оставете, пращаме техник.",
    "Дете на програмист пита:\n- Тате, татеееееее! Що слънцето всеки ден изгрява ей от там?\n- Щом работи, тати, не го пипай!",
    "Дете на програмист: - Тате, тате... От какво са направени облаците?\n- ​​​​​​​От сървъри, момчето ми, предимно под \"Линукс\"....",
    "Ако програмист стане лекар, и му кажеш:\n- Боли ме ръката.\nОтговорът ще бъде:\n- Странно, имам същата ръка и не ме боли.",
    "Съобщение: \"Вчера за пръв път хакер беше осъден за проникване в чужда компютърна мрежа и влезе в затвора да излежава 20-годишна присъда.\nПо данни от централния компютър на полицията, вдругиден хакерът излиза на свобода поради изтичане срока на наказанието\".",
    "- Какво работиш?\n- Помагам на хора в неравностойно положение.\n- О! В някой дом или?\n- Системен администратор съм...",
    "Пред компютъра бъдете хладнокръвни. Ако \"Уиндоус\" разбере, че имате спешна работа, ще почне да се ъпдейтва.",
    "- Какво работиш?\n- Помагам на хора в неравностойно положение.\n- О..., в някой дом или...?\n- Системен администратор съм!",
    "Петгодишен син на програмист пита баща си:\n- Татко, а защо слънцето изгрява от изток, а залязва на запад?\nБащата:\n- Ти провери ли?\nСинът:\n- Да, всеки ден проверявам!\nБащата:\n- За бога, не пипай нищо - всичко работи!",
    "Програмист влиза вечерта в бара и вижда колегата си на една маса, а пред него купчина празни бутилки от уиски. Пита го:\n- Какво се е случило, колега?\n- И-з-т-ри-вам о-пера-тив-ната па-мет!",
    "Ако програмистите бяха лекари, на оплакване от пациент, че го боли крака, щяха да отвръщат: \"Имам същия крак и му няма нищо\".",
    "Microsoft така и не успя да накара ползвателите да се откажат от Windows XP, затова реши да пусне безплатна програма за обновление под името WannaCry.",
    "Жена пита мъжа си програмист:\n\n– Какво пишеш?\n\n– Ей сега, като пусна програмата, и ще видим.",
    "Дете на програмист пита:\n- Тате, татеееееее! Що слънцето всеки ден изгрява, ей от там?\n- Щом работи, тати, не го пипай!",
    "В самолет: - Карай към Виена! - Не мога, за Чипровци съм. - Как за Чипровци?! Там няма летище. - Не знам. Разбери се с бабата отзад, с картофите и леката картечница.",
    "Седи си един на една пейка с много тъжна физиономия. Идва при него един и му казва: - Защо си толкова тъжен? Какво е станало? - Седни, ще ти разкажа. Мъжът сяда. - Проблемът е, че пейката е прясно боядисана...",
    "Двама индианци край пазара: - Ех,Червен бизон, да знаеш как ми липсва жена ми. - Защо? Какво е станало с нея? - Вчера я смених за едно уиски. - И още ти е мъчно за нея? - Не, но страшно ми се пие.",
    "Учителка изпитва ученик. - Разкажи урока! Ученикът мълчи. - Кажи поне заглавието на урока! Ученикът мълчи. - Какъв предмет учим сега? Ученикът мълчи. По едно време от задния чин се чува шепот. - Леле! Тая вещица го разхожда из целия материал!",
    "Вкарват в килията нов затворник-крадец. Той оглежда обстановката и пита надзирателя: - За какво са тия решетки на прозореца? - Заради сигурността. - Вие не сте наред! Кой пък ще иска да обира затвора?",
    "Срещат се двама евреи: - Здрасти, Моше. Имаш ли малко пари да ми дадеш назаем? - Съжалявам, нямам и стотинка в себе си. - А у вас? - У нас всички са добре, благодаря.",
    "- Знаеш ли, че според статистиката над 30% от жените изневеряват на мъжете си? - Статистика, статистика ... За какво ми е на мене тая статистика? Дай имена, адреси, телефони ...",
    "Македонците водят битка, ама губят. Един войник отива при царя и вика: - Царю, губим битката. Трябва да се предадем! Царят разсърден отвръща: - Македонец не се предава, да бегаме!",
    "Надпис в отдел \"Поддръжка на компютърната техника\" на голяма фирма: Теория - това е когато знаете всичко, но нищо не работи. Практика - това е когато всичко работи, но не знаете защо. При нас съчетаваме теорията с практиката, нищо не работи и нямаме понятие защо."
]